Tekla.Structures.Model.RebarSet.FrozenStateEnum
Represents the frozen state of the rebar set.

Tekla.Structures.Model.RebarSet.FrozenStateEnum.NOT_FROZEN
No leg faces or surface in the rebar set is frozen.

Tekla.Structures.Model.RebarSet.FrozenStateEnum.FULLY_FROZEN
All of the leg faces and surfaces of the rebar set are frozen.

Tekla.Structures.Model.RebarSet.FrozenStateEnum.PARTIALLY_FROZEN
Some, but not all of the leg faces and surfaces of the rebar set are frozen.